In [6]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [7]:
df=pd.read_csv('regression_classification_dataset.csv')

In [8]:
df.describe()

              Age  Experience  Hours_Worked  Performance_Score         Salary
count  102.000000  102.000000    102.000000          87.000000     101.000000
mean    39.598039   20.392157     46.936275           3.206897   97279.158416
std     13.952011   12.565990     11.359488           1.503004   38646.244963
min     20.000000   -3.000000     24.100000           1.000000   16527.000000
25%     28.000000   10.000000     40.325000           2.000000   61419.000000
50%     40.000000   23.000000     45.650000           4.000000  105749.000000
75%     47.750000   31.000000     54.025000           4.500000  126901.000000
max    120.000000   39.000000    100.000000           5.000000  165441.000000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102 entries, 0 to 101
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Age                102 non-null    int64
 1   Experience         102 non-null    int64
 2   Education_Level    84 non-null     object
 3   Department         83 non-null     object
 4   Hours_Worked       102 non-null    float64
 5   Performance_Score  87 non-null     float64
 6   Salary             101 non-null    float64
 7   Attrition          102 non-null    object
dtypes: float64(3), int64(2), object(3)
memory usage: 6.5+ KB

In [10]:
df["Education_Level"]=(
    df["Education_Level"].str.lower()
)
df["Department"]=(
    df["Department"].str.lower()
)
# df["Education_Level"]=(
#     df["Education_Level"].str.lower().replace({
#         "ug":""
#         "PhD":"PHD",
#         "sales":""    
#     })
# )

In [11]:
df

,Age,Experience,Education_Level,Department,Hours_Worked,Performance_Score,Salary,Attrition
0,58,22,ug,it,58.6,5.0,115571.0,Yes
1,48,23,phd,sales,53.3,5.0,121764.0,No
2,34,36,NaN,hr,45.2,5.0,158936.0,No
3,27,34,post grad,it,49.4,NaN,148813.0,No
4,40,39,phd,hr,55.5,3.0,157602.0,Yes
...,...,...,...,...,...,...,...,...
97,31,15,ug,it,47.0,1.0,70636.0,Yes
98,53,32,ug,NaN,50.6,1.0,133190.0,Yes
99,52,8,post grad,hr,53.7,5.0,49346.0,No
100,43,36,pg,sales,41.7,1.0,135727.0,Yes
101,55,13,phd,NaN,41.8,5.0,83309.0,No

In [12]:
df.isna().sum()

Age                   0
Experience            0
Education_Level      18
Department           19
Hours_Worked          0
Performance_Score    15
Salary                1
Attrition             0
dtype: int64

In [13]:
# encoding

from sklearn.preprocessing import LabelEncoder 

le=LabelEncoder()

df['Education_Level']=le.fit_transform(df['Education_Level'])
df['Attrition']=le.fit_transform(df['Attrition'])
df['Department']=le.fit_transform(df['Department'])
df

,Age,Experience,Education_Level,Department,Hours_Worked,Performance_Score,Salary,Attrition
0,58,22,3,1,58.6,5.0,115571.0,1
1,48,23,1,2,53.3,5.0,121764.0,0
2,34,36,4,0,45.2,5.0,158936.0,0
3,27,34,2,1,49.4,NaN,148813.0,0
4,40,39,1,0,55.5,3.0,157602.0,1
...,...,...,...,...,...,...,...,...
97,31,15,3,1,47.0,1.0,70636.0,1
98,53,32,3,3,50.6,1.0,133190.0,1
99,52,8,2,0,53.7,5.0,49346.0,0
100,43,36,0,2,41.7,1.0,135727.0,1
101,55,13,1,3,41.8,5.0,83309.0,0

In [15]:
# handle missing values 

# replace Numerical columns → mean

num_cols=["Performance_Score"]
df[num_cols]=df[num_cols].fillna(df[num_cols].mean())

# replace Categorical columns → mode

cat_cols=["Education_Level","Department"]
for col in cat_cols:
    df[col]=df[col].fillna(df[col].mode()[0]) # mode returns index therefore .mode()[0] means replace with the value at index 0